<?php
$array1 = array("红豆","甜蜜","梦中","草莓","魔法","星空","天使","浪漫","一米","完美","锁住","香草","宝蓝","心梦","爱恋","梦想","绝恋","雪舞","璀璨","情迷","林海","净月","童话","天生","糖果","幸福","雕刻","花季","广岛","柠檬","欢乐","飞扬","樱花","茜茜","四月","爱恋","太阳","阳光","幻彩","可可","彩虹","波西","再见","恋人","盛夏","彼岸","奇幻","一帘","美丽","国境","可爱","抹茶","炫彩","星之","蔷薇","玫瑰","沙滩","甜心","花语","青涩","俏丽","左岸","锦瑟","宁静","繁华","挚爱","暧昧","番茄","奔向","栀子","漫舞","蓝莓","薰衣","指尖","燃情");
$array2 = array("南国","之恋","之约","爱情","布丁","物语","伊人","旋律","阳光","恋人","时间","咖啡","殿堂","约定","情缘","晴空","羽翼","倾城","暖冬","泰迪","雪原","舞坛","国度","一对","盒子","预言","时光","雨季","新娘","时光","的雪","之舞","公主","物语","世纪","季节","邻居","美沙","诺言","西里","精灵","米亚","萤火","未满","光年","之花","殿堂","幽梦","蜕变","之旅","米菲","烟火","舞动","金币","花语","精灵","脚印","公主","日记","回忆","佳人","花开","年华","天空","落幕","永恒","情怀","情人","岁月","边缘","云端","糖糖","草香","独舞","之夜");
$count1 = count($array1);
$count2 = count($array2);
for ($i = 0; $i < 100; $i++) {
	$rand1  = rand(0,$count1-1);
	$rand2  = rand(0,$count2-1);
	echo $array1[$rand1].$array2[$rand2]." ";
}
echo "共".$i."个";
?>